[
    {
        "userId": 1,
        "mealName": "Apple Frangipan Tart",
        "mealCategory": "Dessert",
        "mealArea": "British",
        "mealInstructions": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg",
        "mealTags": "Tart,Baking,Fruity",
        "mealYoutube": "https://www.youtube.com/watch?v=rp8Slv4INLk"
    },
    {
        "userId": 1,
        "mealName": "Apple & Blackberry Crumble",
        "mealCategory": "Dessert",
        "mealArea": "British",
        "mealInstructions": "Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\r\nMeanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\r\nTo serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg",
        "mealTags": "Pudding",
        "mealYoutube": "https://www.youtube.com/watch?v=4vhcOwVBDO4"
    },
    {
        "userId": 1,
        "mealName": "Apam balik",
        "mealCategory": "Dessert",
        "mealArea": "Malaysian",
        "mealInstructions": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r\n\r\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r\n\r\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r\n\r\nCut into wedges and best eaten when it is warm.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
        "mealTags": null,
        "mealYoutube": "https://www.youtube.com/watch?v=6R8ffRRJcrg"
    },
    {
        "userId": 1,
        "mealName": "Ayam Percik",
        "mealCategory": "Chicken",
        "mealArea": "Malaysian",
        "mealInstructions": "In a blender, add the ingredients for the spice paste and blend until smooth.\r\nOver medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.\r\nAdd the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes. Stir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.\r\nWhen the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.\r\nPreheat the oven to 425 F.\r\nRemove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.\r\nLet chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice).",
        "mealThumb": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
        "mealTags": null,
        "mealYoutube": "https://www.youtube.com/watch?v=9ytR28QK6I8"
    },
    {
        "userId": 1,
        "mealName": "Chicken Handi",
        "mealCategory": "Chicken",
        "mealArea": "Indian",
        "mealInstructions": "Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!",
        "mealThumb": "https://www.themealdb.com/images/media/meals/wyxwsp1486979827.jpg",
        "mealTags": null,
        "mealYoutube": "https://www.youtube.com/watch?v=IO0issT0Rmc"
    },
    {
        "userId": 1,
        "mealName": "Chicken Congee",
        "mealCategory": "Chicken",
        "mealArea": "Chinese",
        "mealInstructions": "STEP 1 - MARINATING THE CHICKEN\r\nIn a bowl, add chicken, salt, white pepper, ginger juice and then mix it together well.\r\nSet the chicken aside.\r\nSTEP 2 - RINSE THE WHITE RICE\r\nRinse the rice in a metal bowl or pot a couple times and then drain the water.\r\nSTEP 2 - BOILING THE WHITE RICE\r\nNext add 8 cups of water and then set the stove on high heat until it is boiling. Once rice porridge starts to boil, set the stove on low heat and then stir it once every 8-10 minutes for around 20-25 minutes.\r\nAfter 25 minutes, this is optional but you can add a little bit more water to make rice porridge to make it less thick or to your preference.\r\nNext add the marinated chicken to the rice porridge and leave the stove on low heat for another 10 minutes.\r\nAfter an additional 10 minutes add the green onions, sliced ginger, 1 pinch of salt, 1 pinch of white pepper and stir for 10 seconds.\r\nServe the rice porridge in a bowl\r\nOptional: add Coriander on top of the rice porridge.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/1529446352.jpg",
        "mealTags": null,
        "mealYoutube": "https://www.youtube.com/watch?v=kqEfk801E94"
    },
    {
        "userId": 1,
        "mealName": "Chicken Marengo",
        "mealCategory": "Chicken",
        "mealArea": "French",
        "mealInstructions": "Heat the oil in a large flameproof casserole dish and stir-fry the mushrooms until they start to soften. Add the chicken legs and cook briefly on each side to colour them a little.\r\nPour in the passata, crumble in the stock cube and stir in the olives. Season with black pepper – you shouldn’t need salt. Cover and simmer for 40 mins until the chicken is tender. Sprinkle with parsley and serve with pasta and a salad, or mash and green veg, if you like.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/qpxvuq1511798906.jpg",
        "mealTags": null,
        "mealYoutube": "https://www.youtube.com/watch?v=U33HYUr-0Fw"
    },
    {
        "userId": 1,
        "mealName": "Tandoori Chicken",
        "mealCategory": "Chicken",
        "mealArea": "Indian",
        "mealInstructions": "Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/qptpvt1487339892.jpg",
        "mealTags": "Spicy,Meat",
        "mealYoutube": "https://www.youtube.com/watch?v=-CKvt1KNU74"
    },
    {
        "userId": 1,
        "mealName": "Chicken Couscous",
        "mealCategory": "Chicken",
        "mealArea": "Moroccan",
        "mealInstructions": "Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.\r\nTip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/qxytrx1511304021.jpg",
        "mealTags": null,
        "mealYoutube": "https://www.youtube.com/watch?v=GZQGy9oscVk"
    },
    {
        "userId": 1,
        "mealName": "Kung Pao Chicken",
        "mealCategory": "Chicken",
        "mealArea": "Chinese",
        "mealInstructions": "Combine the sake or rice wine, soy sauce, sesame oil and cornflour dissolved in water. Divide mixture in half.\r\nIn a glass dish or bowl, combine half of the sake mixture with the chicken pieces and toss to coat. Cover dish and place in refrigerator for about 30 minutes.\r\nIn a medium frying pan, combine remaining sake mixture, chillies, vinegar and sugar. Mix together and add spring onion, garlic, water chestnuts and peanuts. Heat sauce slowly over medium heat until aromatic.\r\nMeanwhile, remove chicken from marinade and sauté in a large frying pan until juices run clear. When sauce is aromatic, add sautéed chicken and let simmer together until sauce thickens.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/1525872624.jpg",
        "mealTags": null,
        "mealYoutube": "https://www.youtube.com/watch?v=QqdcCHQlOe0"
    },
    {
        "userId": 1,
        "mealName": "Chicken Basquaise",
        "mealCategory": "Chicken",
        "mealArea": "French",
        "mealInstructions": "Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don't crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r\nAdd a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r\nAdd the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn't already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r\nCover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again.",
        "mealThumb": "https://www.themealdb.com/images/media/meals/wruvqv1511880994.jpg",
        "mealTags": "Meat",
        "mealYoutube": "https://www.youtube.com/watch?v=emfm6TwsVhg"
    }
    
]
